# Задача 3. Вариант 20.
# Напишите программу, которая выводит имя "Мария Магдалена фон Лош", и запрашивает его псевдоним. Программа должна сцеплять две эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире.

print ("Герой нашей сегодняшней программы - Мария Магдалена фон Лош")
print ("Под каким же именем мы знаем этого человека?")
name = "Марлен Дитрих"
input_name = input("Ваш ответ:")
if input_name == name:
		print ("Ваш ответ: Марлен Дитрих -" + name)
input ("\n\nНажмите Enter для вывода.")

# Tatonenkov A.R.
# 19.12.2016