# Задача 2. Вариант 20.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Иннокентий (Борисов). Не забудьте о том, что автор должен быть упомянут на отдельной строке.

print ("Можно среди уз быть свободным духом,")
print ("равно как и на престоле можно быть рабом страстей.")
print ("")
print ("						Святитель Иннокентий (Борисов).")

input ("\n\nНажмите Enter для выхода.")

# Tatonenkov A.R.
# 19.12.2016