# Задача 4. Вариант 20.
# Напишите программу, которая выводит имя, под которым скрывается Мари Фрасуа Аруэ. Дополнительно необходимо вывести область интересов указанной личности, место рождения, годы рождения и смерти (если человек умер), вычислить возраст на данный момент (или момент смерти). Для хранения всех необходимых данных требуется использовать переменные. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

print ("Мари Фрасуа Аруэ более известен, как французский писатель и философ Вольтер.")
print ("Место рождения: Париж, Франция")
birth_date = 1694
death_date = 1778
age = death_date - birth_date
print ("Год рождения:", birth_date) 
print ("Возраст:", age)
print ("Область интересов: поэзия, философия.")

input ("\n\nНажмите Enter для выхода.")

# Tatonenkov A.R.
# 19.12.2016